Documents/ПереоценкаТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПереоценкаТМЦ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияРеквизитов</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>InformationRegister.ЦеныТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Цены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажнаяСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажнаяНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Записать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСтарая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазоваяНовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПереоценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДССтарая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСНовая</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Записать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЦеныТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ЦеныТоваров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРеквизитов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараПродажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараВозвратная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТовара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВместимостьУпаковки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокСортировки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодИКПУ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бренд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПереоценкаТМЦ/Forms/ФормаДокумента/Ext/Form/Module.bsl
// Предопределенные
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

// Товары
&НаСервере
Процедура ТоварыЗаполнитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РегОстатки.Склад КАК Склад,
	|	РегОстатки.Товар КАК Товар,
	|	РегОстатки.КоличествоОстаток КАК Остаток,
	|	ИсторияРеквизитовСтавкаНДС.Значение КАК СтавкаНДС,
	|	ВЫБОР КОГДА (РегОстатки.КоличествоОстаток <> 0 И РегОстатки.СуммаОстаток <> 0) ТОГДА (РегОстатки.СуммаОстаток / РегОстатки.КоличествоОстаток) ИНАЧЕ РегЦенаБазовая.Цена КОНЕЦ КАК ЦенаБазовая
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&Дата, Порожняя = Ложь И Бронь = Ложь) КАК РегОстатки
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(&Дата, Тип = ""ЦенаБазовая"") КАК РегЦенаБазовая ПО РегЦенаБазовая.Товар.Ссылка = РегОстатки.Товар.Ссылка
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРеквизитов.СрезПоследних(&Дата, Реквизит = ""СтавкаНДС"") КАК ИсторияРеквизитовСтавкаНДС ПО ИсторияРеквизитовСтавкаНДС.Ссылка.Ссылка = РегОстатки.Товар.Ссылка
	|ГДЕ
	|	(РегОстатки.Товар.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Продукция) или РегОстатки.Товар.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Товар))
	|УПОРЯДОЧИТЬ ПО
	|	РегОстатки.Склад.Наименование,
	|	РегОстатки.Товар.Наименование");

	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаТовар.Следующий() Цикл
		СтарыеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Склад,Товар", ВыборкаТовар.Склад, ВыборкаТовар.Товар));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Товары.Добавить();
		КонецЕсли;
		
		ТекСтрока.Склад = ВыборкаТовар.Склад;
		ТекСтрока.Товар = ВыборкаТовар.Товар;
		ТекСтрока.Количество = ВыборкаТовар.Остаток;
		ТекСтрока.ЦенаБазовая = ВыборкаТовар.ЦенаБазовая;
		ТекСтрока.СтавкаНДССтарая = ВыборкаТовар.СтавкаНДС;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЗаполнить(Кнопка)
	ТоварыЗаполнитьНаСервере();
	
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТоварыПересчитатьСтроку(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
	
	Объект.Товары.Сортировать("Товар");
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбновить(Кнопка)
	Для Каждого ТекСтрока Из Объект.Товары Цикл
		ТекСтрока.ЦенаБазовая = РаботаСТоварами.Цена(ТекСтрока.Товар, "ЦенаБазовая", Объект.Дата, ТекСтрока.ЦенаБазовая);
		ТекСтрока.Количество = РаботаСТоварами.Остаток(ТекСтрока.Склад, ТекСтрока.Товар, Объект.Дата, "Количество");
		ТекСтрока.СуммаСтарая = РаботаСТоварами.Остаток(ТекСтрока.Склад, ТекСтрока.Товар, Объект.Дата, "Сумма");
		ТекСтрока.СуммаПереоценки = ТекСтрока.СуммаНовая - ТекСтрока.СуммаСтарая;
		ТоварыПересчитатьСтроку(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Записать", Ложь)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Товары.Удалить(Строка); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТоварыОбновитьСтроку(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаБазоваяПриИзменении(Элемент)
	ТоварыПересчитатьСтроку(Элементы.Товары.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаБазоваяНоваяПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТекСтрока.Коэффициент = (ТекСтрока.ЦенаБазоваяНовая * 100) / ТекСтрока.ЦенаБазовая - 100;
	
	ТоварыПересчитатьСтроку(ТекСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоэффициентПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	
	ТекСтрока.ЦенаБазоваяНовая = ТекСтрока.ЦенаБазовая * (100 + ТекСтрока.Коэффициент) / 100;
	
	ТоварыПересчитатьСтроку(ТекСтрока.ПолучитьИдентификатор())
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если Элементы.Товары.ТекущийЭлемент.Имя <> "ТоварыЗаписать" Тогда
		ТекСтрока = Элементы.Товары.ТекущиеДанные;
		ТекСтрока.Записать = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТоварыОбновитьСтроку(ИдентификаторСтроки, ОбновитьОстатки = Истина)
	Строка = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Строка.Количество = РаботаСТоварами.Остаток(Строка.Склад, Строка.Товар, Объект.Дата);
	
	ТоварыПересчитатьСтроку(ИдентификаторСтроки);
КонецПроцедуры

&НаСервере
Процедура ТоварыПересчитатьСтроку(ИдентификаторСтроки)
	Строка = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Строка.СуммаСтарая = Строка.Количество * Строка.ЦенаБазовая;
	Строка.СуммаНовая = Строка.Количество * Строка.ЦенаБазоваяНовая;
	
	Если ЗначениеЗаполнено(Строка.СуммаНовая) Тогда
		Строка.СуммаПереоценки = Строка.СуммаНовая - Строка.СуммаСтарая;
	Иначе
		Строка.СуммаПереоценки = 0;
	КонецЕсли;
КонецПроцедуры

// Цены
&НаСервере
Процедура ЦеныЗаполнитьНаСервере()
	Момент = ОбщийМодульСервер.ПолучитьМоментВремениДокумента(Объект);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Товар,
		|	РегЦенаПродажная.Цена КАК ЦенаПродажная
		|ИЗ
		|	Справочник.Товары КАК Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(&Дата, Тип = ""ЦенаПродажная"") КАК РегЦенаПродажная ПО (РегЦенаПродажная.Товар = Товары.Ссылка)
		|ГДЕ
		|	(Товары.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Продукция) ИЛИ Товары.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Товар))
		|"
	);

	Запрос.УстановитьПараметр("Дата", Момент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТовар.Следующий() Цикл
		СтарыеСтроки = Объект.Цены.НайтиСтроки(Новый Структура("Товар", ВыборкаТовар.Товар));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Цены.Добавить();
		КонецЕсли;
		
		ТекСтрока.Товар = ВыборкаТовар.Товар;
		ТекСтрока.ЦенаПродажнаяСтарая = ВыборкаТовар.ЦенаПродажная;
	КонецЦикла;
	
	Объект.Цены.Сортировать("Товар");
КонецПроцедуры

&НаКлиенте
Процедура ЦеныЗаполнить(Кнопка)
	ЦеныЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЦеныОбновитьНаСервере()
	Момент = ОбщийМодульСервер.ПолучитьМоментВремениДокумента(Объект);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Товары.Ссылка КАК Товар,
		|	РегЦенаПродажная.Цена КАК ЦенаПродажная
		|ИЗ
		|	Справочник.Товары КАК Товары
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(&Дата, Тип = ""ЦенаПродажная"") КАК РегЦенаПродажная ПО (РегЦенаПродажная.Товар = Товары.Ссылка)
		|ГДЕ
		|	(Товары.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Продукция) ИЛИ Товары.ВидТовара.ТипТовара = Значение(Перечисление.ТипыТовара.Товар))
		|	И Товары.Ссылка В (&МассивТоваров)
		|"
	);

	Запрос.УстановитьПараметр("Дата", Момент);
	Запрос.УстановитьПараметр("МассивТоваров", Объект.Цены.Выгрузить().ВыгрузитьКолонку("Товар"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаТовар = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаТовар.Следующий() Цикл
		СтарыеСтроки = Объект.Цены.НайтиСтроки(Новый Структура("Товар", ВыборкаТовар.Товар));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Цены.Добавить();
		КонецЕсли;
		
		ТекСтрока.Товар = ВыборкаТовар.Товар;
		ТекСтрока.ЦенаПродажнаяСтарая = ВыборкаТовар.ЦенаПродажная;
		
		ЦеныОбновитьСтроку(ТекСтрока.ПолучитьИдентификатор());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбновить(Кнопка)
	ЦеныОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЦеныУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Цены.НайтиСтроки(Новый Структура("Записать", Ложь)); 
	Для Каждого ТекСтрока Из ПустыеСтроки Цикл 
		Объект.Цены.Удалить(ТекСтрока); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЦеныТоварПриИзменении(Элемент)
	ТекСтрока = Элементы.Цены.ТекущиеДанные;
	ТекСтрока.ЦенаПродажнаяСтарая = РаботаСТоварами.Цена(ТекСтрока.Товар, "ЦенаПродажная", Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ЦеныКоличествоПриИзменении(Элемент)
	ЦеныПересчитатьСтроку(Элементы.Цены.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ЦеныЦенаПродажнаяСтараяПриИзменении(Элемент)
	ЦеныПересчитатьСтроку(Элементы.Цены.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ЦеныЦенаПродажнаяНоваяПриИзменении(Элемент)
	Элементы.Цены.ТекущиеДанные.Записать = Истина;
	
	ЦеныПересчитатьСтроку(Элементы.Цены.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ЦеныОбновитьСтроку(ИдентификаторСтроки)
	Строка = Объект.Цены.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если Строка.ЦенаПродажнаяНовая = 0 Тогда
		Строка.ЦенаПродажнаяНовая = Строка.ЦенаПродажнаяСтарая;
	КонецЕсли;
	
	ЦеныПересчитатьСтроку(ИдентификаторСтроки);
КонецПроцедуры

&НаСервере
Процедура ЦеныПересчитатьСтроку(ИдентификаторСтроки)
	Строка = Объект.Цены.НайтиПоИдентификатору(ИдентификаторСтроки);
КонецПроцедуры

// Вспомагательные
&НаКлиенте
Процедура Обновить()
	
КонецПроцедуры
